package pers.afei.wificracker;

import java.io.File;

/************************************************************
 *                    _ooOoo_
 *                   o8888888o
 *                   88" . "88
 *                   (| -_- |)
 *                   O\  =  /O
 *               ____/`---'\____
 *             .'  \\|     |//  `.
 *            /  \\|||  :  |||//  \
 *           /  _||||| -:- |||||-  \
 *           |   | \\\  -   * |   |
 *           | \_|  ''\---/''  |   |
 *           \  .-\__  `-`  ___/-. /
 *         ___`. .'  /--.--\  `. . __
 *      ."" '<  `.___\_<|>_/___.'  >'"".
 *     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *     \  \ `-.   \_ __\ /__ _/   .-` /  /
 *======`-.____`-.___\_____/___.-`____.-'======
 *                   `=---='
 *^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *
 *         佛祖保佑       永无BUG
 *
 *  本程序已经经过开光处理，绝无可能再产生bug
 **************************************************************/
public class App 
{
    public static void main( String[] args )
    {
        Cracker cracker = new Cracker();
        String dicPath = new File("").getAbsolutePath() + "\\dictionary\\common-0.txt";
        cracker.violentCrack("飝龘龘", dicPath, 400);
    }
}
